app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 24 Sep 2011 15:41:46 UTC +00:00], ["provider", "facebook"], ["uid", "8649455"], ["updated_at", Sat, 24 Sep 2011 15:41:46 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."uid" = '8649455' AND "users"."provider" = 'facebook' LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)